samples/expression_tree_dot/filter_expression.dot
digraph expression {
  rankdir=TB;
  "node000" [label = "XOR", fillcolor = "lightpink", name = "node000", style = "filled"];
  "node001" [label = "OR", fillcolor = "lightcoral", name = "node001", style = "filled"];
  "node002" [label = "OR", fillcolor = "lightcoral", name = "node002", style = "filled"];
  "node003" [label = "AND", fillcolor = "lightgreen", name = "node003", style = "filled"];
  "node004" [label = "NOT", fillcolor = "yellow", name = "node004", style = "filled"];
  "node005" [label = "AND", fillcolor = "lightgreen", name = "node005", style = "filled"];
  "node006" [label = "XOR", fillcolor = "lightpink", name = "node006", style = "filled"];
  "node007" [label = "x0", fillcolor = "lightblue", name = "node007", style = "filled"];
  "node008" [label = "x1", fillcolor = "lightblue", name = "node008", style = "filled"];
  "node009" [label = "x2", fillcolor = "lightblue", name = "node009", style = "filled"];
  "node010" [label = "x3", fillcolor = "lightblue", name = "node010", style = "filled"];
  "node011" [label = "NOT", fillcolor = "yellow", name = "node011", style = "filled"];
  "node012" [label = "x5", fillcolor = "lightblue", name = "node012", style = "filled"];
  "node013" [label = "x6", fillcolor = "lightblue", name = "node013", style = "filled"];
  "node014" [label = "x4", fillcolor = "lightblue", name = "node014", style = "filled"];
  "node000" -> "node001" [label = "L"];
  "node000" -> "node002" [label = "R"];
  "node001" -> "node003" [label = "L"];
  "node001" -> "node004" [label = "R"];
  "node002" -> "node005" [label = "L"];
  "node002" -> "node006" [label = "R"];
  "node003" -> "node007" [label = "L"];
  "node003" -> "node008" [label = "R"];
  "node004" -> "node009";
  "node005" -> "node010" [label = "L"];
  "node005" -> "node011" [label = "R"];
  "node006" -> "node012" [label = "L"];
  "node006" -> "node013" [label = "R"];
  "node011" -> "node014";
}
